Catalogs/ЛБ_ШаблоныПриказовМеталлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЛБ_ШаблоныПриказовМеталлы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДопИнформацияМеталлы</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Металлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Металл</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ДрагоценныеМеталлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проба</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_Пробы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КатегорияОбъектаЗалога</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_КатегорииОбъектовЗалога</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ЛБ_ШаблоныПриказовМеталлы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда  
		Объект.Дата = ТекущаяДата();
		Объект.Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ИнформацияМеталлы = ТекущийОбъект.ДопИнформацияМеталлы.Получить(); 
	
	//ТекстHTML = "";
	//Вложения = Новый Структура;
	//ИнформацияМеталлы.ПолучитьHTML(ТекстHTML, Вложения);
	//
	//Текст = СтроковыеФункцииКлиентСервер.ИзвлечьТекстИзHTML(ТекстHTML);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДопИнформацияМеталлы = Новый ХранилищеЗначения(ИнформацияМеталлы);
КонецПроцедуры

&НаСервере
Процедура СвернутьТаблицу() 
	ТаблицаПроверки = Объект.Металлы.Выгрузить(); 
	ТаблицаПроверки.Свернуть("Металл, Проба, КатегорияОбъектаЗалога");  
	Объект.Металлы.Загрузить(ТаблицаПроверки);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)  
	СвернутьТаблицу();
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораМеталла(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	Запрос  = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец", Результат);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_Пробы.Ссылка КАК Проба
	               |ИЗ
	               |	Справочник.ЛБ_Пробы КАК ЛБ_Пробы
	               |ГДЕ
	               |	ЛБ_Пробы.Владелец = &Владелец
	               |	И ЛБ_Пробы.ПометкаУдаления = ЛОЖЬ";
	ТаблицаПроб = Запрос.Выполнить().Выгрузить();
	
	ВыборкаСпр = Справочники.ЛБ_КатегорииОбъектовЗалога.Выбрать();
	Пока ВыборкаСпр.Следующий() Цикл
		Если ВыборкаСпр.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;	    
		Отбор = Новый Структура;
		Отбор.Вставить("КатегорияОбъектаЗалога", ВыборкаСпр.Ссылка);
		Для каждого стр Из ТаблицаПроб Цикл 
			Отбор.Вставить("Проба", Стр.Проба);  
			СтрокиМ = Объект.Металлы.НайтиСтроки(Отбор);
			Если СтрокиМ.Количество() = 0 Тогда
				НоваяСтр = Объект.Металлы.Добавить();
				НоваяСтр.Проба = Стр.Проба;
				НоваяСтр.Металл = Стр.Проба.Владелец;
			    НоваяСтр.КатегорияОбъектаЗалога = ВыборкаСпр.Ссылка;  
			КонецЕсли;	
		Конеццикла;	
	КонецЦикла;	
	Объект.Металлы.Сортировать("Металл, Проба, КатегорияОбъектаЗалога");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоМеталлу(Команда)
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораМеталла",ЭтаФорма);
    ОткрытьФорму("Справочник.ЛБ_ДрагоценныеМеталлы.ФормаВыбора",,ЭтаФорма,,,,ОбработкаВыбора,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
КонецПроцедуры


&НаСервере
Процедура ПослеВыбораМеталлаОчистить(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Металл", Результат);
	СтрокиМ = Объект.Металлы.НайтиСтроки(Отбор);
	
	Для каждого СтрМ из СтрокиМ Цикл
		Объект.Металлы.Удалить(СтрМ);
	Конеццикла;	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПоМеталлу(Команда)
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораМеталлаОчистить",ЭтаФорма);
    ОткрытьФорму("Справочник.ЛБ_ДрагоценныеМеталлы.ФормаВыбора",,ЭтаФорма,,,,ОбработкаВыбора,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораКатегорииОчистить(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("КатегорияОбъектаЗалога", Результат);
	СтрокиМ = Объект.Металлы.НайтиСтроки(Отбор);
	
	Для каждого СтрМ из СтрокиМ Цикл
		Объект.Металлы.Удалить(СтрМ);
	Конеццикла;	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПоКатегорииОбъекта(Команда)
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораКатегорииОчистить",ЭтаФорма);
    ОткрытьФорму("Справочник.ЛБ_КатегорииОбъектовЗалога.ФормаВыбора",,ЭтаФорма,,,,ОбработкаВыбора,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораПробыОчистить(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Проба", Результат);
	СтрокиМ = Объект.Металлы.НайтиСтроки(Отбор);
	
	Для каждого СтрМ из СтрокиМ Цикл
		Объект.Металлы.Удалить(СтрМ);
	Конеццикла;	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПоПробе(Команда)
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораПробыОчистить",ЭтаФорма);
    ОткрытьФорму("Справочник.ЛБ_Пробы.ФормаВыбора",,ЭтаФорма,,,,ОбработкаВыбора,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
